IDENTIFICATION DIVISION.
PROGRAM-ID. BANK-PRO.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT FICHIER-CLIENT ASSIGN TO "clients.dat"
        ORGANIZATION IS LINE SEQUENTIAL.

    SELECT FICHIER-LOG ASSIGN TO "transactions.log"
        ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.

FD FICHIER-CLIENT.
01 CLIENT-REC.
   05 ID-COMPTE     PIC X(10).
   05 SOLDE         PIC 9(7)V99.

FD FICHIER-LOG.
01 LOG-REC         PIC X(100).

WORKING-STORAGE SECTION.
01 CHOIX           PIC 9.
01 MONTANT         PIC 9(7)V99.
01 WS-ID           PIC X(10) VALUE "C001".
01 CONTINUER       PIC X VALUE 'O'.
01 WS-MESSAGE      PIC X(100).

PROCEDURE DIVISION.

MAIN.
    PERFORM INIT-FICHIERS
    PERFORM MENU UNTIL CONTINUER = 'N'
    PERFORM FERMER-FICHIERS
    STOP RUN.

* ---------------- INIT ----------------
INIT-FICHIERS.
    OPEN I-O FICHIER-CLIENT
    IF FILE STATUS NOT = "00"
        OPEN OUTPUT FICHIER-CLIENT
        MOVE WS-ID TO ID-COMPTE
        MOVE 1000 TO SOLDE
        WRITE CLIENT-REC
        CLOSE FICHIER-CLIENT
        OPEN I-O FICHIER-CLIENT
    END-IF

    OPEN EXTEND FICHIER-LOG.

* ---------------- MENU ----------------
MENU.
    DISPLAY "1- Solde"
    DISPLAY "2- Depot"
    DISPLAY "3- Retrait"
    DISPLAY "4- Quitter"
    ACCEPT CHOIX

    EVALUATE CHOIX
        WHEN 1 PERFORM CONSULTER
        WHEN 2 PERFORM DEPOT
        WHEN 3 PERFORM RETRAIT
        WHEN 4 MOVE 'N' TO CONTINUER
        WHEN OTHER DISPLAY "Choix invalide"
    END-EVALUATE.

* ---------------- LECTURE CLIENT ----------------
LIRE-CLIENT.
    REWRITE CLIENT-REC.

CONSULTER.
    READ FICHIER-CLIENT
    DISPLAY "Compte: " ID-COMPTE
    DISPLAY "Solde: " SOLDE.

* ---------------- DEPOT ----------------
DEPOT.
    DISPLAY "Montant: "
    ACCEPT MONTANT

    IF MONTANT > 0 THEN
        READ FICHIER-CLIENT
        ADD MONTANT TO SOLDE
        REWRITE CLIENT-REC
        PERFORM LOG-DEPOT
        DISPLAY "Depot OK"
    ELSE
        DISPLAY "Montant invalide"
    END-IF.

* ---------------- RETRAIT ----------------
RETRAIT.
    DISPLAY "Montant: "
    ACCEPT MONTANT

    READ FICHIER-CLIENT
    IF MONTANT > 0 AND MONTANT <= SOLDE THEN
        SUBTRACT MONTANT FROM SOLDE
        REWRITE CLIENT-REC
        PERFORM LOG-RETRAIT
        DISPLAY "Retrait OK"
    ELSE
        DISPLAY "Erreur"
    END-IF.

* ---------------- LOGS ----------------
LOG-DEPOT.
    STRING "DEPOT - " MONTANT DELIMITED BY SIZE
           INTO LOG-REC
    WRITE LOG-REC.

LOG-RETRAIT.
    STRING "RETRAIT - " MONTANT DELIMITED BY SIZE
           INTO LOG-REC
    WRITE LOG-REC.

* ---------------- FIN ----------------
FERMER-FICHIERS.
    CLOSE FICHIER-CLIENT
    CLOSE FICHIER-LOG.
